rpa-system/load-test-results/ab_database_health_20250906_211934.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            3030

Document Path:          /api/health/databases
Document Length:        517 bytes

Concurrency Level:      20
Time taken for tests:   0.821 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      162200 bytes
HTML transferred:       51700 bytes
Requests per second:    121.80 [#/sec] (mean)
Time per request:       164.199 [ms] (mean)
Time per request:       8.210 [ms] (mean, across all concurrent requests)
Transfer rate:          192.93 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:    34  145 156.1     70     552
Waiting:       34  144 156.0     69     551
Total:         34  145 156.0     70     552

Percentage of the requests served within a certain time (ms)
  50%     70
  66%     89
  75%    132
  80%    421
  90%    441
  95%    463
  98%    495
  99%    552
 100%    552 (longest request)