rpa-system/load-test-results/ab_database_health_20250906_212256.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            3030

Document Path:          /api/health/databases
Document Length:        517 bytes

Concurrency Level:      20
Time taken for tests:   0.523 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      162134 bytes
HTML transferred:       51700 bytes
Requests per second:    191.05 [#/sec] (mean)
Time per request:       104.685 [ms] (mean)
Time per request:       5.234 [ms] (mean, across all concurrent requests)
Transfer rate:          302.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:    36   83  36.1     72     156
Waiting:       36   83  36.0     72     156
Total:         36   83  36.1     72     156

Percentage of the requests served within a certain time (ms)
  50%     72
  66%     80
  75%    115
  80%    132
  90%    142
  95%    150
  98%    155
  99%    156
 100%    156 (longest request)