rpa-system/load-test-results/ab_database_health_20250906_213759.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            3030

Document Path:          /api/health/databases
Document Length:        488 bytes

Concurrency Level:      20
Time taken for tests:   0.557 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      159300 bytes
HTML transferred:       48800 bytes
Requests per second:    179.65 [#/sec] (mean)
Time per request:       111.325 [ms] (mean)
Time per request:       5.566 [ms] (mean, across all concurrent requests)
Transfer rate:          279.48 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:    38   88  50.9     73     297
Waiting:       38   87  50.9     73     297
Total:         38   88  51.0     73     297

Percentage of the requests served within a certain time (ms)
  50%     73
  66%     90
  75%     99
  80%    106
  90%    143
  95%    171
  98%    285
  99%    297
 100%    297 (longest request)